<h1>Table of Contents<span class="tocSkip"></span></h1>
<div class="toc"><ul class="toc-item"><li><span><a href="#Preface" data-toc-modified-id="Preface-1"><span class="toc-item-num">1&nbsp;&nbsp;</span>Preface</a></span><ul class="toc-item"><li><span><a href="#Description" data-toc-modified-id="Description-1.1"><span class="toc-item-num">1.1&nbsp;&nbsp;</span>Description</a></span></li><li><span><a href="#Imports" data-toc-modified-id="Imports-1.2"><span class="toc-item-num">1.2&nbsp;&nbsp;</span>Imports</a></span></li><li><span><a href="#Get-the-database-config" data-toc-modified-id="Get-the-database-config-1.3"><span class="toc-item-num">1.3&nbsp;&nbsp;</span>Get the database config</a></span></li><li><span><a href="#Load-sql-magic" data-toc-modified-id="Load-sql-magic-1.4"><span class="toc-item-num">1.4&nbsp;&nbsp;</span>Load sql magic</a></span></li><li><span><a href="#Get-names-of-all-tables" data-toc-modified-id="Get-names-of-all-tables-1.5"><span class="toc-item-num">1.5&nbsp;&nbsp;</span>Get names of all tables</a></span></li><li><span><a href="#Connect-the-mysql-server" data-toc-modified-id="Connect-the-mysql-server-1.6"><span class="toc-item-num">1.6&nbsp;&nbsp;</span>Connect the mysql server</a></span></li><li><span><a href="#Avoid-1055-error" data-toc-modified-id="Avoid-1055-error-1.7"><span class="toc-item-num">1.7&nbsp;&nbsp;</span>Avoid 1055 error</a></span></li></ul></li><li><span><a href="#Stored-Procedures" data-toc-modified-id="Stored-Procedures-2"><span class="toc-item-num">2&nbsp;&nbsp;</span>Stored Procedures</a></span><ul class="toc-item"><li><span><a href="#Procedure-with-parameters" data-toc-modified-id="Procedure-with-parameters-2.1"><span class="toc-item-num">2.1&nbsp;&nbsp;</span>Procedure with parameters</a></span></li><li><span><a href="#stored-procedure-in-and-out-parameters" data-toc-modified-id="stored-procedure-in-and-out-parameters-2.2"><span class="toc-item-num">2.2&nbsp;&nbsp;</span>stored procedure in and out parameters</a></span></li></ul></li><li><span><a href="#Variables" data-toc-modified-id="Variables-3"><span class="toc-item-num">3&nbsp;&nbsp;</span>Variables</a></span><ul class="toc-item"><li><span><a href="#Exercise-1" data-toc-modified-id="Exercise-1-3.1"><span class="toc-item-num">3.1&nbsp;&nbsp;</span>Exercise 1</a></span></li></ul></li><li><span><a href="#User-Defined-Functions" data-toc-modified-id="User-Defined-Functions-4"><span class="toc-item-num">4&nbsp;&nbsp;</span>User Defined Functions</a></span></li><li><span><a href="#Avoid-error-1418" data-toc-modified-id="Avoid-error-1418-5"><span class="toc-item-num">5&nbsp;&nbsp;</span>Avoid error 1418</a></span></li></ul></div>

# Preface

## Description
**Notes**  
- Mysql is case insensitive. eg `like('m%')` and `like('M%')` are same.


Entity Relation (ER) Diagram:

![](pdf/employees_db.png)

## Imports

In [1]:
import numpy as np
import pandas as pd
import os
import json

## Get the database config

In [2]:
ifile = os.path.expanduser('~') + "/.mysql_conf.json"
with open(ifile) as fo:
    data = json.load(fo)
    
pw = data['password']

## Load sql magic

In [3]:
%load_ext sql

In [4]:
%sql mysql+mysqlconnector://bhishan:$pw@localhost/employees

'Connected: bhishan@employees'

## Get names of all tables

In [5]:
%%sql
SELECT table_name FROM information_schema.tables
WHERE table_schema = 'employees';

 * mysql+mysqlconnector://bhishan:***@localhost/employees
12 rows affected.

[('current_dept_emp',),
 ('departments',),
 ('departments_dup',),
 ('dept_emp',),
 ('dept_emp_latest_date',),
 ('dept_manager',),
 ('dept_manager_dup',),
 ('emp_manager',),
 ('employees',),
 ('salaries',),
 ('titles',),
 ('v_manager_avg_salary',)]

## Connect the mysql server

In [6]:
import mysql.connector

conn = mysql.connector.connect(
    host='localhost',user='bhishan',passwd=pw,database='employees')

cur = conn.cursor()

In [7]:
%sql select * from dept_manager limit 2;

 * mysql+mysqlconnector://bhishan:***@localhost/employees
2 rows affected.

[(110022, 'd001', datetime.date(1985, 1, 1), datetime.date(1991, 10, 1)),
 (110039, 'd001', datetime.date(1991, 10, 1), datetime.date(9999, 1, 1))]

## Avoid 1055 error

In [8]:
q = "set @@global.sql_mode := replace(@@global.sql_mode, 'ONLY_FULL_GROUP_BY', '');"
cur.execute(q)
conn.commit()

# Stored Procedures

In [9]:
q = """\
use employees;

drop procedure if exists select_4employees;

delimiter $$

create procedure select_4employees()
begin
    select * from employees limit 4;
end$$


delimiter ;
"""
# cursor does not work here.
# work in workbench.

# refresh the schema, we will see new schema

In [10]:
%%sql
call employees.select_4employees();

 * mysql+mysqlconnector://bhishan:***@localhost/employees
4 rows affected.

[(10001, datetime.date(1953, 9, 2), 'Georgi', 'Facello', 'M', datetime.date(1986, 6, 26)),
 (10002, datetime.date(1964, 6, 2), 'Bezalel', 'Simmel', 'F', datetime.date(1985, 11, 21)),
 (10003, datetime.date(1959, 12, 3), 'Parto', 'Bamford', 'M', datetime.date(1986, 8, 28)),
 (10004, datetime.date(1954, 5, 1), 'Chirstian', 'Koblick', 'M', datetime.date(1986, 12, 1))]

In [11]:
exercise1 = """

%%sql

DELIMITER $$

 CREATE PROCEDURE avg_salary()

 BEGIN

                SELECT

                                AVG(salary)

                FROM

                                salaries;

 END$$
DELIMITER ;

CALL avg_salary;

CALL avg_salary();

CALL employees.avg_salary;

CALL employees.avg_salary();

DROP PROCEDURE avg_salary;
""";

## Procedure with parameters

In [12]:
"""
Note: p is p_emp is parameter.


use employees;
drop procedure if exists emp_salary;

delimiter $$

create procedure emp_salary(in p_emp_no integer)
begin
    select
        e.first_name, e.last_name,s.salary,s.from_date,s.to_date
    from employees e
    join salaries s
    on e.emp_no = s.emp_no
    
    where e.emp_no = p_emp_no;
end$$

delimiter ;
    


""";

In [13]:
%%sql
select * from employees limit 2;

 * mysql+mysqlconnector://bhishan:***@localhost/employees
2 rows affected.

[(10001, datetime.date(1953, 9, 2), 'Georgi', 'Facello', 'M', datetime.date(1986, 6, 26)),
 (10002, datetime.date(1964, 6, 2), 'Bezalel', 'Simmel', 'F', datetime.date(1985, 11, 21))]

In [14]:
%sql call emp_salary(10001);

 * mysql+mysqlconnector://bhishan:***@localhost/employees
(mysql.connector.errors.ProgrammingError) 1305 (42000): PROCEDURE employees.emp_salary does not exist
[SQL: call emp_salary(10001);]
(Background on this error at: http://sqlalche.me/e/f405)

In [15]:
# another example
"""

use employees;
drop procedure if exists emp_salary;

delimiter $$

create procedure emp_avg_salary(in p_emp_no integer)
begin
    select
        e.first_name, e.last_name,avg(s.salary)
    from employees e
    join salaries s
    on e.emp_no = s.emp_no
    
    where e.emp_no = p_emp_no;
end$$

delimiter ;
""";

In [16]:
%sql call emp_avg_salary(10001);

 * mysql+mysqlconnector://bhishan:***@localhost/employees
1 rows affected.

[('Georgi', 'Facello', Decimal('75388.9412'))]

## stored procedure in and out parameters

In [17]:
"""
use employees;
drop procedure if exists emp_avg_salary_out;

delimiter $$

create procedure emp_avg_salary_out(in p_emp_no integer, out p_avg_salary decimal(10,2) )
begin
    select
        avg(s.salary)
    into p_avg_salary
        from employees e
        join salaries s
        on e.emp_no = s.emp_no
    
        where e.emp_no = p_emp_no;
end$$

delimiter ;

""";

In [18]:
# %sql call emp_avg_salary_out(10001)

# out parameter is displayed in workbench, not in jupyter notebook.

In [19]:
another_example = """

DELIMITER $$

CREATE PROCEDURE emp_info(in p_first_name varchar(255), in p_last_name varchar(255), out p_emp_no integer)

BEGIN

               SELECT

                               e.emp_no

               INTO p_emp_no FROM

                               employees e

               WHERE

                               e.first_name = p_first_name

                                               AND e.last_name = p_last_name;

END$$

DELIMITER ;
""";

# Variables

In [20]:
"""
set @v_avg_salary = 0;

call employees.emp_avg_salary_out(11300, @v_avg_salary);

select @v_avg_salary;

""";

In [25]:
%sql set @v_avg_salary1 = 0;
%sql call employees.emp_avg_salary_out(11300, @v_avg_salary);
%sql select @v_avg_salary;

 * mysql+mysqlconnector://bhishan:***@localhost/employees
0 rows affected.

[]

## Exercise 1
Create a variable, called ‘v_emp_no’, where you will store the output of the procedure you created in the last exercise.

Call the same procedure, inserting the values ‘Aruna’ and ‘Journel’ as a first and last name respectively.

Finally, select the obtained output.

In [30]:
%%sql
select * from employees limit 1;

 * mysql+mysqlconnector://bhishan:***@localhost/employees
1 rows affected.

[(10001, datetime.date(1953, 9, 2), 'Georgi', 'Facello', 'M', datetime.date(1986, 6, 26))]

In [24]:
"""
SET @v_emp_no = 0;

CALL emp_info('Aruna', 'Journel', @v_emp_no);

SELECT @v_emp_no;

""";

In [32]:
%sql SET @v_emp_no = 0;
%sql CALL emp_info('Aruna', 'Journel', @v_emp_no);
%sql SELECT @v_emp_no;

 * mysql+mysqlconnector://bhishan:***@localhost/employees
0 rows affected.
 * mysql+mysqlconnector://bhishan:***@localhost/employees
1 rows affected.
 * mysql+mysqlconnector://bhishan:***@localhost/employees
1 rows affected.

[(10789,)]

In [33]:
%sql SET @v_emp_no = 0;
%sql CALL emp_info('Georgi', 'Facello', @v_emp_no);
%sql SELECT @v_emp_no;

 * mysql+mysqlconnector://bhishan:***@localhost/employees
0 rows affected.
 * mysql+mysqlconnector://bhishan:***@localhost/employees
(mysql.connector.errors.ProgrammingError) 1172 (42000): Result consisted of more than one row
[SQL: CALL emp_info('Georgi', 'Facello', @v_emp_no);]
(Background on this error at: http://sqlalche.me/e/f405)
 * mysql+mysqlconnector://bhishan:***@localhost/employees
1 rows affected.

[(0,)]

# User Defined Functions

In [34]:
"""
delimiter $$

create function f_emp_avg_salary ( p_emp_no integer) returns decimal(10,2)

begin
declare v_avg_salary decimal(10,2);

select avg(s.salary)
into v_avg_salary
from employees e
join salaries s
on e.emp_no = s.emp_no
where e.emp_no = p_emp_no;

return v_avg_salary;

end$$

delimiter ;


""";

In [39]:
# %sql delimiter $$

# mysql error 1064

In [41]:
# q = 'delimiter $$'
# cur.execute(q)

# syntax to use near 'delimiter $$'

# run the code in workbench.

# Avoid error 1418

Error Code: 1418. This function has none of DETERMINISTIC, NO SQL, or READS SQL DATA in its declaration and binary logging is enabled (you *might* want to use the less safe log_bin_trust_function_creators variable)

In [42]:
"""


SET @@global.log_bin_trust_function_creators := 1;

""";

In [43]:
%sql select f_emp_avg_salary(10001);

 * mysql+mysqlconnector://bhishan:***@localhost/employees
1 rows affected.

[(Decimal('75388.94'),)]

In [44]:
other_examples = """

DELIMITER $$

CREATE FUNCTION emp_info(p_first_name varchar(255), p_last_name varchar(255)) RETURNS decimal(10,2)

BEGIN

               DECLARE v_max_from_date date;

   DECLARE v_salary decimal(10,2);

               SELECT

   MAX(from_date)

INTO v_max_from_date FROM

   employees e

       JOIN

   salaries s ON e.emp_no = s.emp_no

WHERE

   e.first_name = p_first_name

       AND e.last_name = p_last_name;

               SELECT

   s.salary

INTO v_salary FROM

   employees e

       JOIN

   salaries s ON e.emp_no = s.emp_no

WHERE

   e.first_name = p_first_name

       AND e.last_name = p_last_name

       AND s.from_date = v_max_from_date;

           

               RETURN v_salary;

END$$

DELIMITER ;

SELECT EMP_INFO('Aruna', 'Journel');
""";